<?php


return [

    "columns" => [
        "kitchen_inspection" => ["Count", "Question", "YES", "NO", "NA", "السؤال", "الترقيم"],
        "surface_inspection" => ["Count", "Question", "YES", "NO", "NA", "السؤال", "الترقيم"],
        "external_warehouses" => ["Count", "Question", "YES", "NO", "NA", "السؤال", "الترقيم"],
        "glass_breaker_fire_detectors" =>  ["Count", "Question", "YES", "NO", "NA", "السؤال", "الترقيم"],
        "staircase" => ["Count", "Question", "FM", "PM", "NM", "NA", "السؤال", "الترقيم"],
        "CO2" => ["Count", "Question", "الملاحظات", "غير مرضي", "مرضي", "السؤال", "الترقيم"],
        "FM200" => ["Count", "Question", "الملاحظات", "غير مرضي", "مرضي", "السؤال", "الترقيم"],
        "emergency_exits" => ["الملاحظات", "اطار الباب", "الصندوق", "مقبض الباب", "الانسيابية", "الموقع", "العدد"],
        "emergency_shower_eye_wash" => ["الملاحظات", "غير مرضي", "مرضي", "الموقع", "العدد"],
        "fire_blankets" => ["الملاحظات", "غير مرضي", "مرضي", "الموقع", "العدد"],
        "fire_hoses" => ["الملاحظات", "غير مرضي", "مرضي", "الموقع", "العدد"],
        "emergency_headlamps" => ["الملاحظات", "غير مقبول", "مقبول", "الموقع", "العدد"],
        "elevator_inspection" => ["حالة المصعد التشغيلية", "الهاتف", "البطارية", "نظام التهوية", "الأنوار الداخلية", "غرفة المصعد", "حالة الباب", "تفتح على مستوى الدور", "الجرس", "الموقع", "العدد"],
        "fire_sprinklers" => ["Count", "Question", "Status", "السؤال", "الترقيم"],
        "daily_notes" => ["رقم أمر العمل", "الموقع", "الملاحظات", "العدد"],
        // "direct_status_report" => ["الملاحظات", "رقم أمر العمل", "الحالة", "العنصر", "العدد"],
        "night_inspection_tour" => ["الملاحظات", "رقم أمر العمل", "الحالة", "العنصر", "العدد"],
        "fire_extinguishers" => ["الوزن الكامل", "الضغط", "المقياس", "الخرطوم", "الصمام/الختم", "الاسطوانة", "الكابينة", "العنق", "الوزن", "النوع", "الموقع", "رقم الطفاية", "العدد"],
    ],

];
