<?php


return [

    "columns" => [
        "kitchen_inspection" => ["Count", "Question", "YES", "NO", "NA", "السؤال", "الترقيم"],
        "surface_inspection" => ["Count", "Question", "YES", "NO", "NA", "السؤال", "الترقيم"],

        //New
        "boilers" => ["Count", "Question", "YES", "NO", "NA", "السؤال", "الترقيم"],
        "generators" => ["Count", "Question", "YES", "NO", "NA", "السؤال", "الترقيم"],
        "warehouse" => ["NO", "YES", "السؤال", "الترقيم"],
        "refrigerants" => ["Count", "Question", "YES", "NO", "NA", "السؤال", "الترقيم"],
        //New

        "external_warehouses" => ["Count", "Question", "YES", "NO", "NA", "السؤال", "الترقيم"],
        "glass_breaker_fire_detectors" =>  ["Count", "Question", "YES", "NO", "NA", "السؤال", "الترقيم"],
        "staircase" => ["Count", "Question", "Yes", "No", "NA", "السؤال", "الترقيم"],
        "CO2" => ["Count", "Question", "الملاحظات", "نعم", "لا", "N/A", "السؤال", "الترقيم"],
        "FM200" => ["Count", "Question", "الملاحظات", "نعم", "لا", "N/A", "السؤال", "الترقيم"],
        "emergency_exits" => ["الملاحظات", "لا توجد عوائق", "مقاوم الحريق", "الدفاش", "اطار الباب", "الصندوق", "مقبض الباب", "الانسيابية", "الموقع", "العدد"],
        "emergency_shower_eye_wash" => ["الملاحظات", "سليم", "غير سليم", "غير مطلوب", "الموقع", "العدد"],
        "fire_blankets" => ["الملاحظات", "سليم", "غير سليم", "الموقع", "العدد"],
        "breakersfm" => ["الملاحظات", "سليم", "غير سليم", "الموقع", "العدد"],
        "fire_hoses" => ["الملاحظات", "YES", "NO", "الموقع", "العدد"],
        "emergency_headlamps" => ["الملاحظات", "سليم", "غير سليم", "الموقع", "العدد"],
        "elevator_inspection" => ["الملاحظات", "الهاتف", "نظام التهوية", "الأنوار الداخلية", "غرفة المصعد", "حالة الباب", "تفتح على مستوى الدور", "الجرس", "الموقع", "العدد"],
        "fire_sprinklers" => ["Count", "Question", "Status", "السؤال", "الترقيم"],
        "daily_notes" => ["رقم أمر العمل", "الموقع", "الملاحظات", "العدد"],
        // "direct_status_report" => ["الملاحظات", "رقم أمر العمل", "الحالة", "العنصر", "العدد"],
        "night_inspection_tour" => ["الملاحظات", "رقم أمر العمل", "الحالة", "العنصر", "العدد"],


        "fire_extinguishers" => ["الضغط", "الخرطوم", "الصمام/الختم", "الاسطوانة", "القاعدة", "العنق", "الوزن", "النوع", "الموقع", "رقم الطفاية", "العدد"],
    ],

];
